#include <stdio.h>
#include <stdlib.h>
int main() {
	//Ορίζουμε τις μεταβλητές μας
        long long  number1,number2,mhkosakolouthias,torinomhkosakolouthias,N;
	int check;
	//Μηδενίζουμε το μήκος της ακολουθίας καθός θα το χρησιμοποιήσουμε για σύγκριση αργότερα
	mhkosakolouthias=0;
	//Διαβάζει τα δύο όρια
        scanf("%lld",&number1);scanf("%lld",&number2);
	//Στις επόμενες δύο γραμμές δηλώνω ένα πίνακα που επειδή ο συγκεκριμένος χρειάζεται αρκετή μηνήμη που δεν μπορεί να την πάρει με κανονική εντόλη δήλωσης χρησιμοποίησα dynamic arrayο πίνακς αυτός θα αποθηκεύει τον αριθμό της ακολουθίας καθέ αριθμού ώστε να μπορέσουμε να τους χρησιμοποιήσουμε 
	long long *savemhkoi;
	savemhkoi=(long long*)malloc(number2*sizeof(long long)); 
	//Εδώ με την συνθήκη ελέχουμε αν οι αριθμοί που δόθηκαν είναι μεγαλύτεροι του μηδέν και μέσα στο εύρος που καθόρισε η άσκηση αν είναι συνεχίζουμε αλλίος τερματίζεται το πρόγραμμα τυπώνωντας μηδέν
	if (number1>0 && number2>0 && number1<=100000000 && number2<=100000000){
		//Δομή επανάληψης από το πρώτο όριο ωσ το δεύτερο
                for(long long i=number1;i<=number2;i++){
			//Θέτω τον αριθμό που χρησιμοποιώ τώρα ίσο με το i 
                        N=i;
			//Αυτό είναι για να ελέξω την μεθεπόμενη συνθήκη
			check=0;
			//Θέτω το αρχικό μήκος ακολουθίας ίσο με ένα αφού ξεκίνησε η διαδικασία
                        torinomhkosakolouthias=1;
			//Δόμη επανάληψης μέχρι ο αριθμός μας να γίνει ίσος με ένα
                        while(N!=1){
				//Ελεχος αν ο αριθμός μας είναι μεγαλύτερος από το πρώτο όριο,αν έχει γίνει κάποια πράξη πανω του έστο και μία φορα και αν είναι μικρότερος από τον αριθμό ελεχου την επανάληψησ for
				if(N>number1 && check==1 && N<i){
					//Αν είναι προσθέτει στο μήκος του (το υπόλοιπο ουσιαστικά) τον αριθμό που έχει μέσα ο πίνακας που είναι προηγούμενου αριθμού που ίδη ελέξαμε 
					torinomhkosakolouthias+=savemhkoi[N-number1]-1;
					//Και έτσι ο Ν μας γίνεται ένα για να τελιώσει το while
					N=1;
				}
				else{
					//Αλλιός προσθέτει ένα στο μήκος του
                               		torinomhkosakolouthias++;
					//Και ελέχει ανάλογα αν είναι ζυγός ή περιττός
					if((N & 1)==0)
						//Αν είναι ζυγός κάνει shift to right κατά ένα που είναι το ίδιο με το /2
						N>>=1;
					else
						//Αν είναι περιττός κάνει shift to left και προσθέτει μετά τον αριθμό που ήταν πριν +1
						N=(N<<1)+N+1;
					//Εδώ το check γίνετε 1 μετά την πρώτη πράξη και μετά δεν έχει άλλην λειτουργεία μέχρι να ολοκληρωθεί η επανάληψη while
					check=1;
				}
                        }
			//Εδώ αποθηκεύει το μήκος του κάθε αριθμού στην ανάλογη θέση
			savemhkoi[i-number1]=torinomhkosakolouthias;
			//Ελέχει αν το μήκος του τελευταίου αριθμού είναι μεγαλύτερο από το τωρινό μελύτερο και το ανικαθιστά
                        if(torinomhkosakolouthias>mhkosakolouthias)
                                mhkosakolouthias=torinomhkosakolouthias;
                }
		//Τέλος τυπώνει το μεγαλύτερο μήκος ακολουθίας που βρήκε
                printf("%lld\n",mhkosakolouthias);
        }
        else
		//Εδώ είναι από το πρώτο if, το οποίο θα τυπωθεί αν τα όριο ποθ δοθήκαν είναι αρνητικά
                printf("0\n");

return 0;
}
